2.2.013/src/DataProcessors/МК_ОстаткиОтпусков/МК_ОстаткиОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МК_ОстаткиОтпусков</name>
</mdclass:DataProcessor>

2.2.013/src/InformationRegisters/ДанныеДляПодбораСотрудников/ДанныеДляПодбораСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8048febd-cf83-413d-8677-04e1f791040c">
  <name>ДанныеДляПодбораСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="a5e069ee-7936-43e5-ba08-369cfef6082e">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="756ae0d9-f1d5-4f90-8a78-f9d59cf66bd0">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="2348f956-2bde-41ca-a9ce-50267a8ad6a6">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="51fb4128-5516-4c0d-9e12-c279879705d6">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

2.2.013/src/Catalogs/МК_СоответствиеОтсутствий/МК_СоответствиеОтсутствий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_СоответствиеОтсутствий</name>
  <predefined>
    <items>
      <name>БольничныйЛист</name>
      <description>Больничный лист</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>ОплатаДнейУходаЗаДетьмиИнвалидами</name>
      <description>Оплата дней ухода за детьми инвалидами</description>
    </items>
    <items>
      <name>Отгул</name>
      <description>Отгул</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>Отпуск по уходу за ребенком</description>
    </items>
    <items>
      <name>ПрогулНеявка</name>
      <description>Прогул, неявка</description>
    </items>
  </predefined>
  <attributes>
    <name>КодИзМК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект1С</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ВидыОтпусков</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выгружать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Целосменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.МК_РолиИсполнителей</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ЗаявкиНаОтсутствие/МК_ЗаявкиНаОтсутствие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ЗаявкиНаОтсутствие</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОтсутствия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолвоДнейОтсутствия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.МК_СтатусыЗаявокНаОтсутствия</types>
    </type>
  </attributes>
  <attributes>
    <name>КолвоЧасовОтсутствия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Целосменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ1С</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента1С</name>
    <type>
      <types>CatalogRef.МК_СоответствиеОтсутствий</types>
    </type>
  </attributes>
  <attributes>
    <name>IDДокументаМК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияОтсутствия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Групповая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияВ1С</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/DataProcessors/МК_ОстаткиОтпусков/ManagerModule.bsl
&НаСервере
Функция ВыгрузитьОстаткиОтпусковНаСервере(мФорма) Экспорт  
	ИнтерактивныйРежим = Истина;      // Нужно знать, как вызвана функция - интерактивно или регламентом в фоне
	мСпособВыгрузки = 1;              // 1 - выгружаем в МояКоманда, 2 - на диск.    
	
	мВыгрузкаОстатков = Константы.МК_ВыгружатьОстаткиОтпусков.Получить();
	мВыгрузкаДокументов = Константы.МК_ВыгружатьДокументыОтпусков.Получить();
	мДниДоТекущейДаты = Константы.МК_ВыгрузкаОтпусковДниДоТекущейДаты.Получить();
	Если мФорма = Неопределено Тогда
		ИнтерактивныйРежим = Ложь;   
		мДата = ТекущаяДата();        // В фоновом режиме выгрузка происходит на текущую дату.   
	Иначе
		мДир = мФорма.КаталогДляВыгрузкиФайлов;    
		мСпособВыгрузки = мФорма.СпособВыгрузки;   
		мДата = мФорма.ДатаОстатков; 
	КонецЕсли;
	мВозврат = Новый Массив;
	мВозврат1 = Новый Массив;
	мВозврат1.Добавить(0);     // Общий результат
	мВозврат1.Добавить(0);     // Кол-во записей
	мРезультат = Истина;

	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	// Первым делом получим нужные организации
	СписокОрганизаций = ОО.ПолучитьСписокОрганизаций(); 
	// Считаем настройки контактной информации.
	мВидКонтИнф = ОО.ПолучитьВидыКонтИнф(); // Это массив видов контактной информации 1С: 0 - Осн.Эл.Почта, 1 - Доп.Эл.Почта, 2 - Телефон     
	мСотрудники = УточненныйСписокСотрудников(СписокОрганизаций,мДата,мВидКонтИнф);  
	Если мВыгрузкаОстатков Тогда
    	Остатки = ОстаткиОтпусковНаДату(мДата, мСотрудники);   
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	
		мКолво1 = Остатки.vacation_balances.Количество();    
		мВозврат1[1] = мКолво1;
		Если мКолво1 > 0 Тогда    
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();

			Если мСпособВыгрузки = 1 Тогда	    	
				Попытка
					ЗаписатьJSON(ЗаписьJSON, Остатки);	
					ТекстJSON = ЗаписьJSON.Закрыть();
				Исключение                                                          
					Сообщить(ЗначениеВСтрокуВнутр(Остатки));
					ВызватьИсключение(ОписаниеОшибки());
				КонецПопытки;
	    	    мСеанс = ОО.СоздатьСеансСвязи(ИнтерактивныйРежим);
	    	    Если мСеанс = Неопределено Тогда
					// Ошибка авторизации. Ничего не отправляем.   
					мРезультат = Ложь;
					мВозврат1[0] = 0;
				Иначе
					hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/balance", мСеанс);  
					hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
					hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
					hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);
					СтруктураОтвет = ОО.ПроверитьОтвет(hОтвет,"Остатки отпусков",ИнтерактивныйРежим);
					мВозврат1[0] = 1;
				КонецЕсли;
			Иначе      // Выгрузка в файл      		 
				ЗаписатьJSON(ЗаписьJSON, Остатки);	
				ТекстJSON = ЗаписьJSON.Закрыть();
        	    мАдрес = ПоместитьВоВременноеХранилище(ТекстJSON);
				мВозврат1.Добавить(мАдрес);
				мВозврат1.Добавить(ОО.ПолучитьИмяФайла("ОстаткиОтпусков",мДир));
				мВозврат1[0] = 2;			
			КонецЕсли;	
		КонецЕсли;		
	КонецЕсли;	 
	Если мВыгрузкаДокументов Тогда    
		мВозврат2 = Новый Массив;    
		мВозврат2.Добавить(1);  // Общий результат
		мВозврат2.Добавить(0);  // Кол-во документов      
		мКолво2 = 0;
		мСписокДокументов = Новый Массив;
		//мРез = ВыгрузитьСправочникОтпусков(мСпособВыгрузки,мДир,ОО,мВозврат2);    
		// Сначала - отпуска.     
		мДни = Константы.МК_ВыгрузкаОтпусковДниДоТекущейДаты.Получить();
		мДатаНачала = мДата - 24*60*60*мДни;

		мРез = ПолучитьПроведенныеОтсутствия(мДатаНачала, мСотрудники);   
		// Возвращается таблица значений с реквизитами:   
		// Сотрудник, ДатаНачала, ДатаОкончания, КоличествоДней, Нецелосменный, ВидОтпуска, ДокументОснование, Состояние, IDДокументаМК
        //
		Для Каждого мОтпуск Из мРез Цикл
			// Надо найти соответствие
			мВид = Неопределено;
			Если ЗначениеЗаполнено(мОтпуск.ВидОтпуска) Тогда 
				мВид = Справочники.МК_СоответствиеОтсутствий.НайтиПоРеквизиту("Объект1С", мОтпуск.ВидОтпуска)
			Иначе   
				Если мОтпуск.Состояние = Перечисления.СостоянияСотрудника.ОтпускПоУходуЗаРебенком Тогда
					мВид = Справочники.МК_СоответствиеОтсутствий.НайтиПоРеквизиту("Объект1С", "Отпуск по уходу за ребенком")
				ИначеЕсли мОтпуск.Состояние = Перечисления.СостоянияСотрудника.ОтпускПоБеременностиИРодам Тогда	
					мВид = Справочники.МК_СоответствиеОтсутствий.НайтиПоРеквизиту("Объект1С", "Отпуск по беременности и родам")
				КонецЕсли;					
			КонецЕсли;	 
			Если Не (мВид = Неопределено) И мВид.Выгружать Тогда
				мЭлементОтправки = Новый Структура;  
				// Ссылка на заявку (если есть)
				Если ЗначениеЗаполнено(мОтпуск.IDДокументаМК) Тогда
					мID = мОтпуск.IDДокументаМК;
				Иначе
					мID = СокрЛП(мОтпуск.ДокументОснование.УникальныйИдентификатор());
				КонецЕсли;	
				мЭлементОтправки.Вставить("id", мID);
				// Сотрудник                                  
				мЭлементОтправки.Вставить("user_id",СокрЛП(мОтпуск.Сотрудник.УникальныйИдентификатор()));
				мЭлементОтправки.Вставить("absence_type_id", мВид.КодИзМК);
				мЭлементОтправки.Вставить("date_from",Формат(мОтпуск.ДатаНачала,"ДФ=dd.MM.yyyy"));
				мЭлементОтправки.Вставить("date_to", Формат(мОтпуск.ДатаОкончания,"ДФ=dd.MM.yyyy"));
				мЭлементОтправки.Вставить("is_full", НЕ мОтпуск.Нецелосменный);     
				мЭлементОтправки.Вставить("user_name", мОтпуск.ФИО);     
				Если мОтпуск.Нецелосменный Тогда   // Надо добыть часы отсутствия из документа   
					мКолво = мОтпуск.ДокументОснование.ЧасовОтпуска;
				Иначе
					мКолво = мОтпуск.КоличествоДней;
				КонецЕсли;	
				мЭлементОтправки.Вставить("value", мКолво);	
				мКолво2 = мКолво2 + 1;
				мСписокДокументов.Добавить(мЭлементОтправки);
			КонецЕсли;	
		КонецЦикла;
		// Теперь - больничные. 
		мВид = Справочники.МК_СоответствиеОтсутствий.НайтиПоРеквизиту("Объект1С", "Больничный лист"); 
		Если Не (мВид = Неопределено) И мВид.Выгружать Тогда
			мРез = ПолучитьБольничные(мДатаНачала, мСотрудники);  
			// Возвращается таблица значений с реквизитами:   
			// Сотрудник, ДатаНачала, ДатаОкончания, ДокументОснование    
			Для Каждого мБЛ Из мРез Цикл     
				мЭлементОтправки = Новый Структура; 
				мID = СокрЛП(мБЛ.ДокументОснование.УникальныйИдентификатор());
				мЭлементОтправки.Вставить("id", мID);
				мЭлементОтправки.Вставить("user_id",СокрЛП(мБЛ.Сотрудник.УникальныйИдентификатор()));
				мЭлементОтправки.Вставить("absence_type_id", мВид.КодИзМК);
				мЭлементОтправки.Вставить("date_from",Формат(мБЛ.ДатаНачала,"ДФ=dd.MM.yyyy"));
				мЭлементОтправки.Вставить("date_to", Формат(мБЛ.ДатаОкончания,"ДФ=dd.MM.yyyy"));
				мЭлементОтправки.Вставить("is_full", Истина);     
				мЭлементОтправки.Вставить("user_name", мБЛ.ФИО);    
				
				// Посчитаем кол-во дней.
				НачалоДня1 = НачалоДня(мБЛ.ДатаНачала);
				НачалоДня2 = НачалоДня(мБЛ.ДатаОкончания);
				мДни =  (НачалоДня2 - НачалоДня1) / (24 * 3600) + 1;
				мЭлементОтправки.Вставить("value", мДни);  
				мКолво2 = мКолво2 + 1;
				мСписокДокументов.Добавить(мЭлементОтправки); 
			КонецЦикла;
		КонецЕсли;	           
		// Теперь - командировки. 
		мВид = Справочники.МК_СоответствиеОтсутствий.НайтиПоРеквизиту("Объект1С", "Командировка"); 
		Если Не (мВид = Неопределено) И мВид.Выгружать Тогда
			мРез = ПолучитьКомандировки(мДатаНачала, мСотрудники);  
			// Возвращается таблица значений с реквизитами:   
			// Сотрудник, ДатаНачала, ДатаОкончания, ДокументОснование, Нецелосменный, Часы    
			Для Каждого мКом Из мРез Цикл     
				мЭлементОтправки = Новый Структура;   
				Если ЗначениеЗаполнено(мКом.IDДокументаМК) Тогда
					мID = мКом.IDДокументаМК;
				Иначе
					мID = СокрЛП(мКом.ДокументОснование.УникальныйИдентификатор());
				КонецЕсли;	
				мЭлементОтправки.Вставить("id", мID);
				мЭлементОтправки.Вставить("user_id",СокрЛП(мКом.Сотрудник.УникальныйИдентификатор()));
				мЭлементОтправки.Вставить("absence_type_id", мВид.КодИзМК);
				мЭлементОтправки.Вставить("date_from",Формат(мКом.ДатаНачала,"ДФ=dd.MM.yyyy"));
				мЭлементОтправки.Вставить("date_to", Формат(мКом.ДатаОкончания,"ДФ=dd.MM.yyyy"));
				мЭлементОтправки.Вставить("is_full", НЕ мКом.Нецелосменный);     
				мЭлементОтправки.Вставить("user_name", мКом.ФИО);    
				
				Если мКом.Нецелосменный Тогда              
					мЭлементОтправки.Вставить("value", мКом.Часы);  
				Иначе	
					// Посчитаем кол-во дней.
					НачалоДня1 = НачалоДня(мКом.ДатаНачала);
					НачалоДня2 = НачалоДня(мКом.ДатаОкончания);
					мДни =  (НачалоДня2 - НачалоДня1) / (24 * 3600) + 1;
					мЭлементОтправки.Вставить("value", мДни);  
				КонецЕсли;	                                      
				мКолво2 = мКолво2 + 1;
				мСписокДокументов.Добавить(мЭлементОтправки); 
			КонецЦикла;
		КонецЕсли;	

		Если мКолво2 > 0 Тогда  
			мВозврат2[1] = мКолво2;
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
	    	мОтсутствия = Новый Структура("Absences",мСписокДокументов);
			Если мСпособВыгрузки = 1 Тогда        				
				Попытка
					ЗаписатьJSON(ЗаписьJSON, мОтсутствия);	
					ТекстJSON = ЗаписьJSON.Закрыть();
				Исключение                                                          
					Сообщить(ЗначениеВСтрокуВнутр(Остатки));
					ВызватьИсключение(ОписаниеОшибки());
				КонецПопытки;
	    	    мСеанс = ОО.СоздатьСеансСвязи(ИнтерактивныйРежим);
	    	    Если мСеанс = Неопределено Тогда
					// Ошибка авторизации. Ничего не отправляем.   
					мРезультат = Ложь;
					мВозврат2[0] = 0;
				Иначе                               
					hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/absence-list", мСеанс);  
					hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
					hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
					hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);
					СтруктураОтвет = ОО.ПроверитьОтвет(hОтвет,"Отсутствия",ИнтерактивныйРежим);
					мВозврат2[0] = 1;
				КонецЕсли;
			Иначе      // Выгрузка в файл      		 
				ЗаписатьJSON(ЗаписьJSON, мОтсутствия);	
				ТекстJSON = ЗаписьJSON.Закрыть();
        	    мАдрес = ПоместитьВоВременноеХранилище(ТекстJSON);
				мВозврат2.Добавить(мАдрес);
				мВозврат2.Добавить(ОО.ПолучитьИмяФайла("ДокументыОтсутствий",мДир));
				мВозврат2[0] = 2;			
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;                                                              
	мВозврат.Добавить(мВозврат1);
	мВозврат.Добавить(мВозврат2);
	Возврат мВозврат;
КонецФункции

&НаСервере
Функция ОстаткиОтпусковНаДату(мДата, мСотрудники)  
	
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("ДатаОстатков",  мДата);
	мПараметры.Вставить("Сотрудники", мСотрудники);
	мПараметры.Вставить("ИсключаемыеРегистраторы");
	мПараметры.Вставить("ВидыОтпусков",  Новый Массив);
	мНужен = Ложь;
		
	// Таблица ТаблицаОстатковОтпусков не обязательно заполнена в общем случае. Если создать отчет "Остатки отпусков по
	// сотрудникам, то она заполняется. Но это ненадежный метод
	
	// В общем модуле конфигурации "ОстаткиОтпусков" есть функция с таким же названием. Она выполняет заполнение
	// нужной таблицы и возвращает ее. Казалось бы - вот оно. Но она падает по ошибке с нашим
	// набором параметров.
	// Выдернул оттуда заполнение регистра ЗаработанныеПраваНаОтпуска.
	ДатаОстатков = мДата;
    ОстаткиОтпусков.РасчетЗаработанныхОтпусков(
		мПараметры.Сотрудники,
		мДата,
		Ложь,              // мПараметрыОстатков.ЭтоРасчетПриУвольнении,
		Неопределено);     //ПараметрыОстатков.ОтраслевыеОсобенности);    
		
		
	// Для СкопироватьРекурсивно надо сделать структуру параметров 
	мПараметры1 = Новый Структура;
	
	мПараметры1.Вставить("ДатаОстатков", мДата);
	мПараметры1.Вставить("Сотрудники", мПараметры.Сотрудники);
	мПараметры1.Вставить("ВидыОтпусков", мПараметры.ВидыОтпусков);
	мПараметры1.Вставить("ИсключаемыеРегистраторы");
	мПараметры1.Вставить("ЭтоРасчетПриУвольнении", Ложь);
	мПараметры1.Вставить("ЗаработанныеПраваНаГодВперед", Ложь);
	мПараметры1.Вставить("ОтраслевыеОсобенности");
	
	
	ПараметрыТаблицыОстатков = ОбщегоНазначения.СкопироватьРекурсивно(мПараметры1);

	ТабОО = ОстаткиОтпусков.ТаблицаОстатковОтпусков(мПараметры);
	ТабОО.Свернуть("Сотрудник", "Дни");
	
	Итог = Новый Структура;
	СотрОтп = Новый Массив;
	мНомер = 1;  
	мДата1 = Формат(мДата, "ДФ=dd.MM.yyyy"); 
	// Тут надо идти по первоначальному списку сотрудников, а дни искать в новой таблице
	// Если сотрудник не найден, отправлять 0.
	
	Для Каждого мСотр Из мПараметры.Сотрудники Цикл
		// Поискать в таблице 
		ДанныеОО = Новый Структура;  
		ДанныеОО.Вставить("xml_id", мНомер);
		ДанныеОО.Вставить("user_id", СокрЛП(мСотр.УникальныйИдентификатор()));
		ДанныеОО.Вставить("calc_date", мДата1);                  
		мСтрока = ТабОО.Найти(мСотр);
		Если Не (мСтрока = Неопределено) Тогда
			мДни = мСтрока.Дни;   
		Иначе	              
			мДни = 0;
		КонецЕсли;	
		ДанныеОО.Вставить("balance", мДни);   
		СотрОтп.Добавить(ДанныеОО);
		мНомер = мНомер +1
	КонецЦикла;
	
	Если СотрОтп.Количество() > 0 Тогда
		Итог.Вставить("vacation_balances", СотрОтп);
	КонецЕсли;
	Возврат Итог;
КонецФункции

&НаСервере
Функция УточненныйСписокСотрудников(СписокОрганизаций,мДата,мВидКонтИнф)  
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();
	// Получим данные по фильтрам выгрузки
	ФильтрСотрудники = ОО.ПолучитьФильтрСотрудники();   // Возвращается массив: {ВидДействия,СписокСотрудников} Вид действия: "0" - не учитывать, "1" - выгружать, "2" - не выгружать.
	ФильтрДолжности = ОО.ПолучитьФильтрДолжности(); 
	ФильтрВидыЗанятости = ОО.ПолучитьФильтрВидыЗанятости(); 
	ФильтрПодразделения = ОО.ПолучитьФильтрПодразделения();
	
	мСотрудники = Новый Массив;		
	Сотрудники = ПолучитьСписокСотрудников(СписокОрганизаций,ФильтрВидыЗанятости,ФильтрПодразделения,ФильтрДолжности,ФильтрСотрудники);
	
	//Пока Сотрудники.Следующий() Цикл    
	Для Каждого мСотр из Сотрудники Цикл 
		мНужен = Ложь;
		Если мСотр.ВАрхиве   // Тут договора подряда не нужны. У них отпусков быть не может. Новая вводная. Надо по ним выгружать нули (если вообще выгружать).
			ИЛИ (мСотр.ПоДоговоруГПХ       // У договорников нет дат поступления/увольнения. Вместо них - Начало и Окончание
				И (мСотр.Начало = Дата(1,1,1)
				ИЛИ (мСотр.Окончание > Дата(1,1,1)
				И мСотр.Окончание < ТекущаяДата() )))
			ИЛИ (НЕ мСотр.ПоДоговоруГПХ
				И (мСотр.ДатаПриема = Дата(1,1,1) 
				ИЛИ (мСотр.ДатаУвольнения > Дата(1,1,1))))
			ИЛИ НЕ ЗначениеЗаполнено(мСотр.Ссылка)
			ИЛИ НЕ ЗначениеЗаполнено(мСотр.ОрганизацияСотрудника) Тогда				
			Продолжить;
		КонецЕсли;  
		
		мСписКонт = мСотр.КонтактнаяИнформация;   // Остатки отпусков будем отправлять только на сотрудников, имеющих "главную" почту
        Для Каждого ВыбКонт из мСписКонт Цикл 
			Если ВыбКонт.Вид = мВидКонтИнф[0] Тогда  // Это - вид главной почты.
				мНужен = Истина;
            КонецЕсли; 
		КонецЦикла;

		Если мНужен Тогда        			
			мСотрудники.Добавить(мСотр.Ссылка);                                             			
		КонецЕсли;	
	КонецЦикла;
	Возврат мСотрудники;
КонецФункции	

Функция ПолучитьСписокСотрудников(СписокОрганизаций,ФильтрВидыЗанятости,ФильтрПодразделения,ФильтрДолжности,ФильтрСотрудники)
	
	УстановитьПривилегированныйРежим(Истина);
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Организации", СписокОрганизаций);
	мЗапрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());
	мЗапрос.Текст =  
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ДанныеДляПодбора.Начало) КАК Начало
		|ПОМЕСТИТЬ СрезДанных
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|ГДЕ
		|	ДанныеДляПодбора.Организация В(&Организации)
		|	И ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|   &УсловияФильтров
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникСотрудники.Ссылка КАК Ссылка,
		|	СправочникСотрудники.Код КАК Код,
		|	ДанныеДляПодбора.Наименование КАК НаименованиеСотрудника,
		|	СправочникСотрудники.ВАрхиве КАК ВАрхиве,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриема,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения,
		|	ВЫБОР
		|		КОГДА ДанныеДляПодбора.Филиал = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА ДанныеДляПодбора.Филиал
		|		ИНАЧЕ ДанныеДляПодбора.Организация
		|	КОНЕЦ КАК ОрганизацияСотрудника,
		|	СправочникСотрудники.ПометкаУдаления КАК ПометкаУдаления,
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		|	ДанныеДляПодбора.Начало КАК Начало,
		|	ДанныеДляПодбора.Окончание КАК Окончание, 
		|	ДанныеДляПодбора.ПоДоговоруГПХ КАК ПоДоговоруГПХ, 
		|	ФизическиеЛица.КонтактнаяИнформация.(
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		ЗначенияПолей КАК ЗначенияПолей
		|	) КАК КонтактнаяИнформация
		|ИЗ
		|	СрезДанных КАК СрезДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
		|		ПО (ДанныеДляПодбора.Сотрудник = СправочникСотрудники.Ссылка)
		|			И (ДанныеДляПодбора.Наименование = СправочникСотрудники.Наименование)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ПО (ДанныеДляПодбора.Сотрудник = ТекущиеКадровыеДанныеСотрудников.Сотрудник)
		|			И (ДанныеДляПодбора.ФизическоеЛицо = ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФизическиеЛица.Ссылка)"; 
	
	
	    // Тут надо добавить условия по сотрудникам, видам занятости, подразделениям и должностям, если они есть.   
	 мТекст = "";
	 Если ФильтрСотрудники[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Сотрудники",ФильтрСотрудники[1]);	
		 Если ФильтрСотрудники[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = "   И ДанныеДляПодбора.Сотрудник В (&Сотрудники)";
	     Иначе
		     мТекст = "   И НЕ (ДанныеДляПодбора.Сотрудник В (&Сотрудники))";
		 КонецЕсли;	                                                       		   
	 КонецЕсли;	       
	  Если ФильтрДолжности[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Должности",ФильтрДолжности[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если ФильтрДолжности[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.Должность В (&Должности)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.Должность В (&Должности))";
		 КонецЕсли;			   
	 КонецЕсли;                                         
	 Если ФильтрВидыЗанятости[2] = "2" Тогда   // Это про ГПХ. Тут "выгружать ГПХ" не означает, что всех остальных выгружать не надо
		 Если НЕ ПустаяСтрока(мТекст) Тогда    // Поэтому интересует только факт невыгрузки 
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 мТекст = мТекст + "    И НЕ ДанныеДляПодбора.ПоДоговоруГПХ"
	 КонецЕсли;	 
	 Если ФильтрВидыЗанятости[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("ВидыЗанятости",ФильтрВидыЗанятости[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если ФильтрВидыЗанятости[0] = "1" Тогда  // Учитываем, выгружаем.
			Если ФильтрВидыЗанятости[2] <> "2" Тогда
			 	мТекст = мТекст + "    И (ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости) ИЛИ ДанныеДляПодбора.ПоДоговоруГПХ)";
			Иначе	
				мТекст = мТекст + "    И ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости)";
			КонецЕсли;	
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости))";
		 КонецЕсли;			   
	 КонецЕсли;   
	  Если ФильтрПодразделения[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Подразделения",ФильтрПодразделения[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если ФильтрПодразделения[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.Подразделение В Иерархии(&Подразделения)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.Подразделение В Иерархии(&Подразделения))";
		 КонецЕсли;			   
	 КонецЕсли;     

	мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловияФильтров",мТекст); 
	
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выгрузить();
	Возврат Выборка;
КонецФункции
     
// Справочник отпусков больше выгружать не нужно - все по справочнику МК_СоответствиеОтсутствий	 
Функция ВыгрузитьСправочникОтпусков(мСпособВыгрузки, мДир, ОО, мВозврат2)     
	мРез = Истина;
	мВыборка = ПолучитьВидыОтпусков();  
	мВидыОтпусков = Новый Массив;   
	Пока мВыборка.Следующий() Цикл   
		мОтпуск = Новый Структура;
		мОтпуск.Вставить("id",СокрЛП(мВыборка.Ссылка.УникальныйИдентификатор()));
		мОтпуск.Вставить("name",СокрЛП(мВыборка.НаименованиеПолное)); 
		Если мВыборка.ОсновнойОтпуск Тогда
			мОсн = 1;
		Иначе
			мОсн = 0
		КонецЕсли;	
		мОтпуск.Вставить("main",мОсн);
		Если мВыборка.Ежегодный Тогда
			мЕж = 1;
		Иначе
			мЕж = 0
		КонецЕсли;	
		мОтпуск.Вставить("annual",мЕж); 
		Если мВыборка.ОтпускБезОплаты Тогда
			мБО = 1;
		Иначе
			мБО = 0
		КонецЕсли;	
		мОтпуск.Вставить("unpaid",мБО);
		Если мВыборка.Недействителен Тогда
			мНД = 1;
		Иначе
			мНД = 0
		КонецЕсли;	
		мОтпуск.Вставить("invalid",мНД);
		мВидыОтпусков.Добавить(мОтпуск);
	КонецЦикла;   
	мВыгрузка = Новый Структура;
	мВыгрузка.Вставить("types_holidays",мВидыОтпусков);
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	Если мСпособВыгрузки = 1 Тогда
		Попытка
			ЗаписатьJSON(ЗаписьJSON, мВыгрузка);	
			ТекстJSON = ЗаписьJSON.Закрыть();
		Исключение  
			мРез = Ложь;
			Сообщить(ЗначениеВСтрокуВнутр(мВыгрузка));
			ВызватьИсключение(ОписаниеОшибки());
		КонецПопытки; 

		мРез = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен).
		//hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/user-properties", мСеанс);     
		//hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		//hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);
		//мОтвет = ОО.ПроверитьОтвет(hОтвет,"Справочники начислений и удержаний",ИнтерактивныйРежим);   // Пока этот мОтвет не анализируется.		
	Иначе   // Выгружаем на диск.  		
		ЗаписатьJSON(ЗаписьJSON, мВыгрузка);	
		ТекстJSON = ЗаписьJSON.Закрыть();
        мАдрес = ПоместитьВоВременноеХранилище(ТекстJSON); 
		мВозврат2.Добавить(мАдрес);
		мВозврат2.Добавить(ОО.ПолучитьИмяФайла("СправочникВидовОтпусков",мДир));			
    КонецЕсли;     	
	Возврат мРез;  	
КонецФункции	

Функция ПолучитьВидыОтпусков()  
	УстановитьПривилегированныйРежим(Истина);
	
	мЗапрос = Новый Запрос;
			
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыОтпусков.Ссылка КАК Ссылка,
	|	ВидыОтпусков.ОтпускЯвляетсяЕжегодным КАК Ежегодный,
	|	ВидыОтпусков.НаименованиеПолное КАК НаименованиеПолное,
	|	ВидыОтпусков.ОтпускБезОплаты КАК ОтпускБезОплаты,
	|	ВидыОтпусков.Недействителен КАК Недействителен,
	|	ВидыОтпусков.ОсновнойОтпуск КАК ОсновнойОтпуск
	|ИЗ
	|	Справочник.ВидыОтпусков КАК ВидыОтпусков
	|ГДЕ
	|	НЕ ВидыОтпусков.ПометкаУдаления";

    РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Возврат Выборка;		
КонецФункции

&НаСервере
Функция ПолучитьПроведенныеОтсутствия(мДатаНачала, мСотрудники)  
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("мДата", мДатаНачала);  
	Запрос.УстановитьПараметр("Сотрудники", мСотрудники);

	
	Запрос.Текст =
	"ВЫБРАТЬ 	
	|	Сотрудники.Ссылка КАК Сотрудник,	          
	|	Сотрудники.Представление КАК ФИО  
	|ПОМЕСТИТЬ ВТОтбораСотрудников
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&Сотрудники);    
	|
	|ВЫБРАТЬ                                   
	|	СписокСотрудников.Сотрудник КАК Сотрудник,  
	|	СписокСотрудников.ФИО КАК ФИО,  
	|   ПериодыОтпусков.ДатаНачала КАК ДатаНачала,
	|   ПериодыОтпусков.ДатаОкончания КАК ДатаОкончания,
	|   ПериодыОтпусков.КоличествоДней КАК КоличествоДней,
	|   ПериодыОтпусков.ОтсутствиеВТечениеЧастиСмены КАК Нецелосменный,
	|   ПериодыОтпусков.ВидОтпуска КАК ВидОтпуска,
	|   ПериодыОтпусков.ДокументОснование КАК ДокументОснование, 
	|   ПериодыОтпусков.Состояние КАК Состояние,	
	|	ЕСТЬNULL(Заявки.IDДокументаМК, """") КАК IDДокументаМК  
	|ИЗ
	|   ВТОтбораСотрудников КАК СписокСотрудников
	|		Левое Соединение РегистрСведений.ПериодыОтпусков КАК ПериодыОтпусков   
	|  		ПО ПериодыОтпусков.Сотрудник = СписокСотрудников.Сотрудник
	|       Левое Соединение Справочник.МК_ЗаявкиНаОтсутствие КАК Заявки
	|       ПО ПериодыОтпусков.ДокументОснование = Заявки.Документ1С
	|ГДЕ		
	|	ПериодыОтпусков.ДатаОкончания >= &мДата		
	|";
	//|СГРУППИРОВАТЬ ПО
	//|	СписокСотрудников.Сотрудник";
	 	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выгрузить();     
	Возврат Выборка;
КонецФункции	

Функция ПолучитьБольничные(мДатаНачала, мСотрудники);   
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("мДата", мДатаНачала);  
	Запрос.УстановитьПараметр("Сотрудники", мСотрудники);

	
	Запрос.Текст =
	"ВЫБРАТЬ 	
	|	Сотрудники.Ссылка КАК Сотрудник,	          
	|	Сотрудники.Представление КАК ФИО,  
	|	Сотрудники.ФизическоеЛицо КАК Физлицо  
	|ПОМЕСТИТЬ ВТОтбораСотрудников
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&Сотрудники);    
	|
	|ВЫБРАТЬ                                   
	|	СписокСотрудников.Сотрудник КАК Сотрудник,  
	|	СписокСотрудников.ФИО КАК ФИО,  	
	|   Больничный.ДатаНачала КАК ДатаНачала,
	|   Больничный.ДатаОкончания КАК ДатаОкончания,
	//|   ПериодыОтпусков.КоличествоДней КАК КоличествоДней,
	|   Больничный.Ссылка КАК ДокументОснование 	
	//|	ЕСТЬNULL(Заявки.IDДокументаМК, """") КАК IDДокументаМК  
	|ИЗ
	|   ВТОтбораСотрудников КАК СписокСотрудников
	|		Левое Соединение Документ.БольничныйЛист КАК Больничный
	|  		ПО Больничный.ФизическоеЛицо = СписокСотрудников.Физлицо
	|ГДЕ		
	|	Больничный.ДатаОкончания >= &мДата
	|	И Больничный.ПричинаНетрудоспособности <> Значение(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам)
	|	И Больничный.ПометкаУдаления = ЛОЖЬ
	|";
	
	// Отпуск по беременности и родам выгружается вместе с другими отпусками. Поэтому тут его отрубаем.
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выгрузить();     
	Возврат Выборка;
КонецФункции	

Функция ПолучитьКомандировки(мДатаНачала, мСотрудники); 
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("мДата", мДатаНачала);  
	Запрос.УстановитьПараметр("Сотрудники", мСотрудники);

	
	Запрос.Текст =
	"ВЫБРАТЬ 	
	|	Сотрудники.Ссылка КАК Сотрудник,	          
	|	Сотрудники.Представление КАК ФИО  
	|ПОМЕСТИТЬ ВТОтбораСотрудников
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&Сотрудники);    
	|
	|ВЫБРАТЬ                                   
	|	СписокСотрудников.Сотрудник КАК Сотрудник,  
	|	СписокСотрудников.ФИО КАК ФИО,  
	|   Командировки.ДатаНачала КАК ДатаНачала,
	|   Командировки.ДатаОкончания КАК ДатаОкончания,	
	|   Командировки.ВнутрисменнаяКомандировка КАК Нецелосменный,	
	|   Командировки.Ссылка КАК ДокументОснование, 	
	|   Командировки.ОплачиватьЧасов КАК Часы, 	
	|	ЕСТЬNULL(Заявки.IDДокументаМК, """") КАК IDДокументаМК  
	|ИЗ
	|   ВТОтбораСотрудников КАК СписокСотрудников
	|		Левое Соединение Документ.Командировка КАК Командировки   
	|  		ПО Командировки.Сотрудник = СписокСотрудников.Сотрудник
	|       Левое Соединение Справочник.МК_ЗаявкиНаОтсутствие КАК Заявки
	|       ПО Командировки.Ссылка = Заявки.Документ1С                
	|		Левое Соединение Документ.Командировка КАК КомандировкиИспр
	|  		ПО Командировки.Ссылка = КомандировкиИспр.ИсправленныйДокумент
	|ГДЕ		
	|	Командировки.ДатаОкончания >= &мДата		
	|	И Командировки.ПометкаУдаления = Ложь
	|	И Командировки.Проведен	
	|   И ЕСТЬNULL(КомандировкиИспр.Ссылка, 
	|		ЗНАЧЕНИЕ(Документ.Командировка.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.Командировка.ПустаяССылка)
	|
	|";
	
	// Ниже - пример выборки документов, не имеющих исправительных "дочек"
	//ВЫБРАТЬ
    //ОсновнойДокумент.Ссылка
	//ИЗ
    //Документ.НачислениеОтпускаРаботникамОрганизаций КАК ОсновнойДокумент
    //    ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеОтпускаРаботникамОрганизаций КАК ДокументПересчета
    //    ПО ОсновнойДокумент.Ссылка = ДокументПересчета.ПерерассчитываемыйДокумент
	//ГДЕ
    //ДокументПересчета.Ссылка ЕСТЬ NULL 
    //И ЕСТЬNULL(ОсновнойДокумент.ПерерассчитываемыйДокумент, ЗНАЧЕНИЕ(Документ.НачислениеОтпускаРаботникамОрганизаций.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.НачислениеОтпускаРаботникамОрганизаций.ПустаяСсылка)
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выгрузить();     
	Возврат Выборка;
КонецФункции
